a5021/stm32-async-1wire/src/ds18b20.c
    if (max_devices == 0) {
        return 0;
    }

    // Repeat the search until every device has been enumerated
    while (!last_device && found < max_devices) {
        if (!search_reset()) {
            // No device answered - reset and stop the search
            last_discrepancy = 0;
            break;
        }

        send_byte(DS18B20_SEARCH_ROM);

        uint16_t id_bit_number = 1;
        uint16_t last_zero = 0;
        for (uint8_t byte_idx = 0; byte_idx < DS18B20_ROM_BYTES; byte_idx++) {
            uint8_t mask = 1;
            for (uint8_t bit_idx = 0; bit_idx < DS18B20_BITS_PER_BYTE; bit_idx++) {
                uint8_t id_bit, cmp_bit, direction;
                read_2bits(&id_bit, &cmp_bit);
                if (id_bit && cmp_bit) {
                    // No device follows this path - search tree exhausted
                    last_discrepancy = 0;
                    return found;
                }
                if (id_bit != cmp_bit) {
                    // Single device on this path - its bit fixes the direction
                    direction = id_bit;
                } else if (id_bit_number < last_discrepancy) {
                    // Follow the previously taken path
                    direction = (rom[byte_idx] & mask) ? 1u : 0u;
                } else {
                    // At the discrepancy point take the '1' branch first
                    direction = (id_bit_number == last_discrepancy) ? 1u : 0u;
                }
                if (direction) {
                    rom[byte_idx] |= mask;
                } else {
                    rom[byte_idx] &= (uint8_t)~mask;
                    last_zero = id_bit_number;
                }
                write_bit(direction);
                id_bit_number++;
                mask <<= 1;
            }
        }
        last_discrepancy = last_zero;

        // Validate the assembled ROM address
        if (crc8_calc(rom, DS18B20_ROM_BYTES) != 0) {
            break;
        }

        found++;
        if (sink && sink(rom)) {
            break; // Callback requested an early stop
        }
        if (last_discrepancy == 0) {
            last_device = 1; // This was the last device on the bus
        }
    }

    return found;
}

/**
 * @}
 */
